// Задача 2: Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
Console.Clear ();

int prompt(string message)
{
Console.WriteLine(message);
string number = Console.ReadLine();
int nuInt = int.Parse(number);
return numInt;
}

int x = Promt ("Введите 1й координат = ")
int x = Promt ("Введите 1й координат = ")
int x = Promt ("Введите 1й координат = ")
int x = Promt ("Введите 1й координат = ")
int x = Promt ("Введите 1й координат = ")
int x = Promt ("Введите 1й координат = ")

//if ( x==0 || y==0 || z==0)
{
   // SystemConsole.WriteLine("Одна из координат равна нулю");
}

